app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Geometry"], ["room_number", 29]]

    def update
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Sex Education"], ["id", 1]]